app/controllers/base_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`auth_token` = 'uGvNzEoKJxTdF5PRPJZMDs3k' LIMIT 1
---
  def auth_user
    unless request.headers['Authorization']
      return render json: {error: {message: 'unauthorized user'}}, status: 401
    end
    @current_user ||= User.find_by(auth_token: request.headers['Authorization'])